0xDiyor/netstick/archive/v1-dashboard/sdkconfig.defaults
# ---- Target / CPU ----
CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- Flash: T-Dongle-C5 is 16MB quad (QIO) @ 80MHz ----
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ---- PSRAM: 8MB quad ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# ---- Partitions ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- Console over the built-in USB Serial/JTAG (the C5 has no USB-OTG) ----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- Wi-Fi: room for a big dual-band scan ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# ---- TLS: bundled root CAs so we can talk to api.github.com ----
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# ---- FatFs: long filenames. NOTE: exFAT is NOT compiled into IDF, card must be FAT32 ----
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

# ---- lwIP / SNTP ----
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# ---- Main task ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
